Repository: emabo/mulk
Catalog: po/*.po
Languages: it

source: Open link #%d, url: %s, tmp file: %s
it: Apertura connessione #%d, url: %s, file temporaneo: %s

source: The file will be deleted.
it: Il file verrà cancellato.

source: Close link #%d
it: Chiusura connessione #%d

source: Downloaded %d/%d chunks, %<PRIdMAX>/%<PRIdMAX> bytes
it: Scaricati %d/%d chunk, %<PRIdMAX>/%<PRIdMAX> byte

source: RESULT: Metalink downloaded successfully, Filename:"%s" Size:%<PRIdMAX>
it: RISULTATO: Metalink scaricato con successo, Nome del file:"%s" Dimensione:%<PRIdMAX>

source: RESULT: Metalink error, no more usable URLs for downloading, Filename:"%s"
it: RISULTATO: errore Metalink, non ci sono più URL utili per scaricare, Nome del file:"%s"

source: PRESENT
it: PRESENTE

source: EMPTY
it: VUOTO

source: NULL
it: NULLO

source: NO CHUNK
it: NESSUN CHUNK

source: No compatible checksum to verify.
it: Nessuna checksum compatibile da verificare.

source: Verifying %s checksum on %s. This may take a while...
it: Verifica della checksum %s su %s. L'operazione potrebbe richiedere un po' di tempo...

source: Checksum correct.
it: Checksum corretta.

source: Checksum wrong.
it: Checksum errata.

source: Chunk checksum correct.
it: Checksum del chunk corretta.

source: Chunk checksum wrong.
it: Checksum del chunk errata.

source: Checking chunk no. %d
it: Verifica del chunk no. %d

source: Resuming file: %s, verified %d/%d chunks.
it: Ripristino del file: %s, verificati %d/%d chunk.

source: Found chunk checksum of %s type.
it: Trovata checksum del chunk di tipo %s.

source: ERROR: wrong length in chunk checksum.
it: ERRORE: lunghezza errata nella checksum del chunk.

source: filesize: %<PRIdMAX>
it: dimensione del file: %<PRIdMAX>

source: number of chunks: %d
it: numero di chunk: %d

source: chunk size: %<PRIdMAX>
it: dimensione del chunk: %<PRIdMAX>

source: last chunk size: %<PRIdMAX>
it: dimensione dell'ultimo chunk: %<PRIdMAX>

source: List of valid countries:
it: Elenco dei paesi ammessi

source: Country Continent Name
it: Paese Continente Nome

source: List of valid continents:
it: Elenco dei continenti ammessi:

source: Continent Name
it: Continente Nome

source: Add option coming from text file: %s%s%s
it: Aggiunta dell'opzione presa dal file di testo: %s%s%s

source: ERROR: option not valid inside an option file
it: ERRORE: opzione non valida all'interno del file delle opzioni

source: Add url to download coming from text file: %s
it: Aggiunta della url da scaricare presa dal file di testo: %s

source: Add Metalink file to download coming from text file: %s
it: Aggiunta del file Metalink da scaricare preso dal file di testo: %s

source: Saving file: %s
it: Salvataggio del file: %s

source: ERROR: creating directory error no. %d
it: ERRORE: errore no. %d nella creazione della directory

source: ERROR: saving file error no. %d
it: ERRORE: errore no. %d nel salvataggio del file

source: ERROR: executing external filter program %s
it: ERRORE: esecuzione programma di filtraggio esterno %s

source: Image GIF %s: %s, width = %d, height = %d
it: Immagine GIF %s: %s, larghezza = %d, altezza = %d

source: Image JPG %s: %s, width = %d, height = %d
it: Immagine JPG %s: %s, larghezza = %d, altezza = %d

source: ERROR: resource "%s" uses a not supported protocol ("%s")
it: ERRORE: la risorsa "%s" utilizza un protocollo non supportato ("%s")

source: ERROR: resource "%s" has an inconsistent protocol ("%s")
it: ERRORE: la risorsa "%s" ha un protocollo inconsistente ("%s")

source: ERROR: fail parsing Metalink file, error code=%d
it: ERRORE: codice di errore %d nella lettura del file Metalink

source: name = %s
it: nome = %s

source: resource = %s
it: risorsa = %s

source: ERROR: increase HASH_TABLE_SIZE to a larger value and recompile
it: ERRORE: incrementa HASH_TABLE_SIZE ad un valore maggiore e ricompila

source: CAlloc: %d
it: Allocati: %d

source: Free: %d
it: Liberati: %d

source: Memory Leaks: %d
it: Perdite di Memoria: %d

source: chunck %%%d, number %d
it: chunck %%%d, numero %d

source: ERROR: pointer to add already present at %s:%d
it: ERRORE: puntatore da aggiungere già presente in %s:%d

source: ERROR: free NULL pointer at %s:%d
it: ERRORE: free di puntatore NULLO in %s:%d

source: ERROR: bad free (0x%lx) at %s:%d
it: ERRORE: free errato (0x%lx) in %s:%d

source: ERROR: %s,%d: memory allocation failed (%ld bytes)
it: ERRORE: %s,%d: allocazione di memoria fallita (%ld byte)

source: libcURL version %s
it: libcURL versione %s

source: No usable URLs for downloading
it: Non ci sono URL utilizzabili per lo scaricamento

source: ERROR: fdset
it: ERRORE: fdset

source: ERROR: timeout
it: ERRORE: timeout

source: ERROR: num_fd:%d, time_to_wait %li, error message %s (%d)
it: ERRORE: num_fd:%d, time_to_wait %li, messaggio di errore %s (%d)

source: RESULT: %d (%s),
it: RISULTATO: %d (%s),

source: HTTP Code:"%ld" Mime-Type:"%s"
it: Codice HTTP:"%ld" Mime-Type:"%s"

source: Url:"%s" Size:%<PRIdMAX>
it: Url:"%s" Dimensione:%<PRIdMAX>

source: ERROR: message=%d
it: ERRORE: messaggio=%d

source: Total time to download = %ld seconds
it: Tempo totale di scaricamento = %ld secondi

source: Total downloaded files = %ld
it: File totali scaricati = %ld

source: Total size downloaded = %.2f KB
it: Dimensione totale scaricata = %.2f KB

source: Average data rate = %.2f KB/s
it: Velocità media di scaricamento = %.2f KB/s

source: display version number and exit
it: visualizza numero di versione ed esce

source: General options
it: Opzioni generali

source: display this help and exit
it: visualizza questo aiuto ed esce

source: quiet (no output)
it: silenzioso (nessun output)

source: be verbose
it: prolisso

source: identify as different agent instead of Mulk/VERSION
it: si identifica come agente differente da Mulk/VERSIONE

source: Download options
it: Opzioni di scaricamento

source: maximum simultaneous connections per host
it: numero massimo di connessioni simultanee per host

source: wrong value for maximum simultaneous connections per host
it: valore errato del numero massimo di connessioni simultanee per host

source: maximum simultaneous connections
it: numero massimo di connessioni simultanee

source: wrong value for maximum simultaneous connections
it: valore errato del numero massimo di connessioni simultanee

source: username to use for the connection
it: nome utente da usare per la connessione

source: password to use for the connection
it: password da usare per la connessione

source: <host[:port]> use HTTP proxy on given host and port
it: <host[:port]> utilizza il proxy HTTP presente sull'host e la porta dati

source: cookie string for HTTP session
it: sequenza di cookie per sessione HTTP

source: load cookies from file for HTTP session
it: carica cookies dal file per sessione HTTP

source: save cookies to file after HTTP session
it: salva cookies nel file dopo sessione HTTP

source: execute an external program to filter or modify URLs to download
it: esegue un programma esterno per filtrare o modificare URL da scaricare

source: maximum recursion depth (0 for infinite)
it: profondità massima di ricorsione (0 per infinito)

source: wrong depth values
it: valori di profondità errati

source: Recursive download options
it: Opzioni di scaricamento ricorsivo

source: don't get all images, links, etc. needed to display HTML page
it: non scaricare tutte le immagini, i collegamenti, ecc. necessari a visualizzare la pagina HTML

source: make links relative in downloaded HTML pages
it: rendi i collegamenti relativi nelle pagine HTML salvate

source: go to foreign hosts
it: visita anche altri host

source: comma-separated list of accepted domains
it: lista dei domini accettati separati da virgole

source: comma-separated list of rejected domains
it: lista dei domini rifiutati separati da virgole

source: follow FTP links from HTML documents
it: segui i collegamenti FTP dai documenti HTML

source: text file with list of options
it: file di testo contenente lista di opzioni

source: Input options
it: Opzioni di ingresso

source: text file with list of URLs to download
it: file di testo contenente lista di URL da scaricare

source: Metalink filename
it: nome del file Metalink

source: Metalink options
it: Opzioni Metalink

source: text file with list of Metalink files to download
it: file di testo contenente lista di file Metalink da scaricare

source: comma-separated list of accepted countries
it: lista di continenti accettati separati da virgole

source: print full list of valid countries
it: stampa elenco completo di paesi ammessi

source: comma-separated list of accepted continents
it: lista di continenti accettati separati da virgole

source: print full list of valid continents
it: stampa elenco completo di continenti ammessi

source: operating system to be considered in Metalink files
it: sistema operativo da considerare nei file Metalink

source: language to be considered in Metalink files
it: lingua da considerare nei file Metalink

source: filename to resume
it: nome del file per il recupero dello scaricamento

source: follow Metalink files from HTML documents
it: segui i file Metalink nei documenti HTML

source: report filename
it: nome del file di rapporto

source: Reporting options
it: Opzioni dei rapporti

source: report CSV filename
it: nome del file CSV di rapporto

source: write report to file every n lines
it: scrivi il rapporto ogni n linee

source: wrong maximum number of lines for writing report
it: errato il massimo numero di linee per scrivere il rapporto

source: don't save whole site tree to disk (enabled by default)
it: non salva l'intero albero del sito su disco (abilitato di default)

source: Saving options
it: Opzioni di salvataggio

source: save GIF images to mime output directory
it: salva le immagini GIF nella directory di output dei mime

source: save PNG images to mime output directory
it: salva le immagini PNG nella directory di output dei mime

source: save JPEG images to mime output directory
it: salva le immagini JPEG nella directory di output dei mime

source: save URLs with specific mime-type to mime output directory
it: salva le URL con uno specifico mime-type nella directory di output dei mime

source: mime output directory
it: directory di output dei mime

source: file output directory
it: directory di output dei file

source: temporary directory
it: directory temporanea

source: minimum image width
it: larghezza minima delle immagini

source: wrong minimum image width
it: larghezza minima delle immagini errata

source: Image options (active only with --save-gif-image, --save-png-image or --save-jpeg-image)
it: Opzioni delle immagini (attive solo con --save-gif-image, --save-png-image or --save-jpeg-image)

source: maximum image width
it: larghezza massima delle immagini

source: wrong maximum image width
it: larghezza massima delle immagini errata

source: minimum image height
it: altezza minima delle immagini

source: wrong minimum image height
it: altezza minima delle immagini errata

source: maximum image height
it: altezza massima delle immagini

source: wrong maximum image height
it: altezza massima delle immagini errata

source: Add domain to list: %s
it: Aggiunto dominio alla lista: %s

source: ERROR: Metalink location length is wrong: %s
it: ERRORE: la lunghezza della locazione del Metalink è errata: %s

source: Add Metalink location to list: %s
it: Aggiunta della locazione del Metalink alla lista: %s

source: WARNING: removing temporary directory
it: ATTENZIONE: rimozione directory temporanea

source: long option inserted %d, %s
it: opzione lunga inserita %d, %s

source: short option string %s
it: stringa delle opzioni corte %s

source: Mulk %s, a non-interactive multi-connection network downloader with image filtering and Metalink support.
it: Mulk %s, programma non interattivo per scaricare file dalla rete con filtro sulle immagini e supporto per Metalink.

source: Mulk %s, a non-interactive multi-connection network downloader with image filtering.
it: Mulk %s, programma non interattivo per scaricare file dalla rete con filtro sulle immagini.

source: Usage: Mulk [OPTION]... [URL]...
it: Uso: Mulk [OPZIONE]... [URL]...

source: Mulk version %s
it: Mulk versione %s

source: ERROR: option not recognised
it: ERRORE: opzione non riconosciuta

source: option recognised %d, %s=%s
it: opzione riconosciuta %d, %s=%s

source: ERROR: this option (%s) needs to be followed by a value
it: ERRORE: questa opzione (%s) deve essere seguita da un valore

source: ERROR: %s
it: ERRORE: %s

source: ERROR: option type not valid, %d
it: ERRORE: tipo dell'opzione non valido, %d

source: Add url to download coming from command line: %s
it: Aggiunta della url da scaricare presa dalla linea di comando: %s

source: ERROR: wrong url: %s
it: ERRORE: url errata: %s

source: ERROR: url not present
it: ERRORE: url non presente

source: Try `mulk --help' for more information.
it: Prova `mulk --help' per avere maggiori informazioni.

source: Image PNG %s: %s, width = %d, height = %d
it: Immagine PNG %s: %s, larghezza = %d, altezza = %d

source: ERROR: printf format
it: ERRORE: formato printf

source: ERROR: vnsprintf failed
it: ERRORE: vnsprintf fallita
